<script lang="ts">
	import CommentCard from './commentCard.svelte';

	export let toggleModal: () => void;

	const comments = [
		{
			name: 'ชื่อผู้ นามสกุลเชี่ยวชาญ',
			position: 'ตำแหน่ง/affiliation ของผู้เชี่ยวชาญ',
			content:
				'ความเห็นของผู้เชี่ยวชาญให้ความว่า บลาบลาบลาบลาบลานาน่า คนไทยน่าจะลงคะแนนแบบนั้น แบบนี้ สมมติว่าคนนี้พูดไว้ ประมาณนี้ๆๆ',
		},
		{
			name: 'ชื่อผู้ นามสกุลเชี่ยวชาญ',
			position: 'ตำแหน่ง/affiliation ของผู้เชี่ยวชาญ',
			content:
				'ความเห็นของผู้เชี่ยวชาญให้ความว่า บลาบลาบลาบลาบลานาน่า คนไทยน่าจะลงคะแนนแบบนั้น แบบนี้ สมมติว่าคนนี้พูดไว้ ประมาณนี้ๆๆ',
		},
		{
			name: 'ชื่อผู้ นามสกุลเชี่ยวชาญ',
			position: 'ตำแหน่ง/affiliation ของผู้เชี่ยวชาญ',
			content:
				'ความเห็นของผู้เชี่ยวชาญให้ความว่า บลาบลาบลาบลาบลานาน่า คนไทยน่าจะลงคะแนนแบบนั้น แบบนี้ สมมติว่าคนนี้พูดไว้ ประมาณนี้ๆๆ',
		},
	];
</script>

<div
	class="text-left flex flex-col w-[312px] md:w-[650px] pb-10 mt-10 relative bg-white h-full"
>
	<svg
		class="absolute right-0 md:-right-[100px] -top-6 cursor-pointer"
		width="32"
		height="33"
		viewBox="0 0 32 33"
		fill="none"
		xmlns="http://www.w3.org/2000/svg"
		on:click={toggleModal}
	>
		<path
			fill-rule="evenodd"
			clip-rule="evenodd"
			d="M9.4 8.99668L8 10.3969L14.6 16.9978L8 23.5987L9.4 24.9989L16 18.398L22.6 24.9989L24 23.5987L17.4 16.9978L24 10.3969L22.6 8.99668L16 15.5976L9.4 8.99668Z"
			fill="#231F20"
		/>
	</svg>
	<h4 class="typo-h7 text-xl">ปัจจัยต่อผลการเลือกตั้ง</h4>
	<h6 class="font-bold typo-h6 mt-1 mb-5">
		การย้ายพรรคของนักการเมือง ส่งผลอย่างไรต่อการเลือกตั้ง?
	</h6>
	<h4 class="typo-ibmplex typo-b4">
		หากข้อสันนิษฐานที่ว่า ส.ส. เขต มาจาก การเลือกเพราะตัวบุคคล และ ส.ส. บัญชี
		รายชื่อ มาจากการเลือกเพราะพรรคเป็น จริง การย้ายพรรคของนักการเมืองอาจ
		ส่งผลต่อคะแนนเสียงที่พรรคได้รับจาก บุคคลที่ลงสมัคร ส.ส. เขต
		<br />
		<br />
		ดังนั้น เมื่อการเลือกตั้งปี 66 เป็นระบบ บัตร 2 ใบ (แยก ส.ส. เขต และ ส.ส. บัญชีรายชื่อ
		ออกจากกัน) และมี ส.ส. เขตจำนวนไม่น้อยที่ย้ายจากพรรคที่เคย สังกัดเมื่อปี 62 จึงต้อง
		ประเมินข้อ สันนิษฐานนี้เพื่อแจกแจงสัดส่วน คะแนนไปยังบัตรทั้ง 2 ใบ
		<br />
		<br />
		ยกตัวอย่างเช่น หากคุณมองว่า การเลือก ตั้ง 62 คนไทยเลือก ส.ส. เขตจากตัวบุคคล 100%
		คะแนนของ ส.ส. เขตที่ย้ายพรรค ก็จะไปอยู่ กับพรรคสังกัดใหม่ในการ เลือกตั้งครั้งนี้
		แต่หากคุณคิดว่า คนไทย เลือก ส.ส. เขตจาก พรรค 100% การย้ายพรรคของ ส.ส. เขต ก็จะไม่มีผล
		ต่อการคำนวณคะแนนในครั้งนี้
	</h4>
	<h6 class="typo-h6 font-bold my-5">ความเห็นจากผู้เชี่ยวชาญ</h6>
	<div class="flex flex-col gap-y-5">
		{#each comments as comment}
			<CommentCard
				name={comment.name}
				position={comment.position}
				content={comment.content}
			/>
		{/each}
	</div>
</div>
