import React, { ReactElement } from 'react';
import { usePersonStore } from '../../../store/person';
import { useTour } from '@reactour/tour';

type Props = {}

const TutorialButton: React.FC<{ children: ReactElement, onClick?: Function }> = ({ children, onClick }) => {
  return (
    <button className={`w-[300px] h-[60px] typo-b5 bg-contain bg-center bg-no-repeat`}
      style={{ backgroundImage: `url('${process.env.BASE_PATH}/design_assets/frame.jpg')` }}
      onClick={() => onClick && onClick()}>
      {children}
    </button>
  )
}

const Tutorial = (props: Props) => {
  const { setOpenTutorial } = usePersonStore()
  const { setIsOpen, setCurrentStep } = useTour()

  return (
    <div className='w-full h-full relative
      bg-[#FFFFFFc7] flex flex-col justify-center items-center'>
      <div className={`flex w-[340px] justify-center items-center`}>
        <div className='flex flex-col gap-y-[20px] justify-center w-full'>
          <div className='relative flex flex-col justify-center gap-y-[10px] bg-white
      border-black border-[3px] rounded-[10px] p-[20px]'>
            <button className='absolute top-[20px] right-[20px]' onClick={() => setOpenTutorial(false)}>
              <svg width={24} height={25} viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M5.04285 5.40186C5.06834 5.63132 5.32104 5.80992 5.46317 5.97132C6.2289 6.84088 7.07345 7.6021 7.91053 8.39835C8.60455 9.05852 9.31582 9.70481 10.0054 10.3644C11.1353 11.4452 12.2969 12.4796 13.3951 13.5778C14.4638 14.6466 15.6373 15.5513 16.6627 16.6557C17.0587 17.0821 17.5241 17.4321 17.9305 17.8624C18.1782 18.1246 18.8273 18.8251 19.1982 18.8251" stroke="#090909" strokeWidth={2} strokeLinecap="round" />
                <path d="M4.43274 19.9235C7.56015 16.7961 10.6629 13.6072 14.0188 10.7306C14.8977 9.97732 15.7934 9.24822 16.6357 8.45275C16.9917 8.11647 17.367 7.51746 17.8559 7.35449" stroke="#090909" strokeWidth={2} strokeLinecap="round" />
              </svg>
            </button>
            <div className='flex flex-row justify-center items-center gap-x-[10.24px]'>
              <svg width={38} height={27} viewBox="0 0 38 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M17.5555 13.4871C17.5555 15.4053 18.0169 17.2451 18.696 18.832C19.4447 20.602 20.6375 22.0494 21.9956 23.1218C23.4495 24.2728 25.1559 24.761 27.0103 24.761C28.8647 24.761 30.5276 24.2117 31.9815 23.0608C33.3397 21.9883 34.6891 20.6456 35.4379 18.8756C36.1169 17.2887 36.5 15.4053 36.5 13.4784C36.5 11.5514 35.9515 9.74656 35.2724 8.15967C34.5237 6.38967 33.5225 4.75046 32.1644 3.66928C30.7104 2.51834 28.8647 2.00391 27.0103 2.00391C25.1559 2.00391 23.3538 2.57937 21.8999 3.73031C20.5417 4.80277 19.6363 6.4507 18.8875 8.2207C18.2085 9.8076 17.5555 11.5602 17.5555 13.4871Z" fill="white" stroke="#090909" strokeWidth={2} strokeMiterlimit={10} strokeLinejoin="round" />
                <path d="M26.8973 13.4868C26.8973 14.9691 27.4371 16.338 28.1771 17.3581C29.0303 18.5178 30.2927 19.1979 31.6682 19.1979C33.0438 19.1979 34.2365 18.4742 35.0897 17.3146C35.8385 16.2944 36.2563 14.9691 36.2563 13.4955C36.2563 12.022 35.7862 10.7228 35.0375 9.7114C34.1843 8.55175 33.0351 7.81934 31.6595 7.81934C30.284 7.81934 29.0129 8.45584 28.1597 9.62421C27.4109 10.6444 26.8886 12.022 26.8886 13.5043L26.8973 13.4868Z" fill="#090909" stroke="#090909" strokeWidth={2} strokeMiterlimit={10} strokeLinejoin="round" />
                <path d="M1.6408 13.487C1.6408 15.4053 2.346 17.1317 3.01637 18.7273C3.76509 20.4973 4.67053 22.1016 6.02868 23.1741C7.4826 24.325 9.23252 25.1272 11.0869 25.1272C12.9413 25.1272 14.6564 24.2727 16.1104 23.1218C17.4685 22.0493 18.6525 20.5932 19.41 18.8319C20.089 17.245 20.6201 15.4053 20.6201 13.487C20.6201 11.5688 20.1761 9.69418 19.497 8.10728C18.7483 6.33728 17.5817 4.77654 16.2322 3.70408C14.7783 2.55315 12.95 1.87305 11.0956 1.87305C9.24123 1.87305 7.53483 2.71881 6.08091 3.86103C4.72276 4.93349 3.41685 6.32856 2.65941 8.09856C1.98034 9.68546 1.64951 11.5775 1.64951 13.4958L1.6408 13.487Z" fill="white" stroke="#090909" strokeWidth={2} strokeMiterlimit={10} strokeLinejoin="round" />
                <path d="M10.9999 13.4874C10.9999 14.9696 11.4961 16.3473 12.2449 17.3674C13.0981 18.5271 14.3692 19.2159 15.7447 19.2159C17.1203 19.2159 18.4262 18.5445 19.2707 17.3849C20.0194 16.3647 20.3938 14.9609 20.3938 13.4874C20.3938 12.0138 19.8801 10.706 19.1401 9.6858C18.2869 8.52615 17.1116 7.76758 15.7447 7.76758C14.3779 7.76758 13.2287 8.54359 12.3755 9.70324C11.6267 10.7234 10.9999 12.0051 10.9999 13.4874Z" fill="#090909" stroke="#090909" strokeWidth={2} strokeMiterlimit={10} strokeLinejoin="round" />
              </svg>
              <div className='typo-b4 font-bold'>ดูอะไรดี?</div>
              <svg width={38} height={27} viewBox="0 0 38 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M20.4445 13.4871C20.4445 15.4053 19.9831 17.2451 19.304 18.832C18.5553 20.602 17.3625 22.0494 16.0044 23.1218C14.5505 24.2728 12.8441 24.761 10.9897 24.761C9.13526 24.761 7.47239 24.2117 6.01847 23.0608C4.66032 21.9883 3.31087 20.6456 2.56215 18.8756C1.88307 17.2887 1.5 15.4053 1.5 13.4784C1.5 11.5514 2.04848 9.74656 2.72756 8.15967C3.47629 6.38967 4.47749 4.75046 5.83564 3.66928C7.28956 2.51834 9.13526 2.00391 10.9897 2.00391C12.8441 2.00391 14.6462 2.57937 16.1001 3.73031C17.4583 4.80277 18.3637 6.4507 19.1125 8.2207C19.7915 9.8076 20.4445 11.5602 20.4445 13.4871Z" fill="white" stroke="#090909" strokeWidth={2} strokeMiterlimit={10} strokeLinejoin="round" />
                <path d="M11.1027 13.4868C11.1027 14.9691 10.5629 16.338 9.82292 17.3581C8.96972 18.5178 7.70734 19.1979 6.33177 19.1979C4.95621 19.1979 3.76347 18.4742 2.91027 17.3146C2.16155 16.2944 1.74365 14.9691 1.74365 13.4955C1.74365 12.022 2.21378 10.7228 2.96251 9.7114C3.81571 8.55175 4.96491 7.81934 6.34048 7.81934C7.71604 7.81934 8.98713 8.45584 9.84033 9.62421C10.5891 10.6444 11.1114 12.022 11.1114 13.5043L11.1027 13.4868Z" fill="#090909" stroke="#090909" strokeWidth={2} strokeMiterlimit={10} strokeLinejoin="round" />
                <path d="M36.3592 13.487C36.3592 15.4053 35.654 17.1317 34.9836 18.7273C34.2349 20.4973 33.3295 22.1016 31.9713 23.1741C30.5174 24.325 28.7675 25.1272 26.9131 25.1272C25.0587 25.1272 23.3436 24.2727 21.8896 23.1218C20.5315 22.0493 19.3475 20.5932 18.59 18.8319C17.911 17.245 17.3799 15.4053 17.3799 13.487C17.3799 11.5688 17.8239 9.69418 18.503 8.10728C19.2517 6.33728 20.4183 4.77654 21.7678 3.70408C23.2217 2.55315 25.05 1.87305 26.9044 1.87305C28.7588 1.87305 30.4652 2.71881 31.9191 3.86103C33.2772 4.93349 34.5832 6.32856 35.3406 8.09856C36.0197 9.68546 36.3505 11.5775 36.3505 13.4958L36.3592 13.487Z" fill="white" stroke="#090909" strokeWidth={2} strokeMiterlimit={10} strokeLinejoin="round" />
                <path d="M27.0001 13.4874C27.0001 14.9696 26.5039 16.3473 25.7551 17.3674C24.9019 18.5271 23.6308 19.2159 22.2553 19.2159C20.8797 19.2159 19.5738 18.5445 18.7293 17.3849C17.9806 16.3647 17.6062 14.9609 17.6062 13.4874C17.6062 12.0138 18.1199 10.706 18.8599 9.6858C19.7131 8.52615 20.8884 7.76758 22.2553 7.76758C23.6221 7.76758 24.7713 8.54359 25.6245 9.70324C26.3733 10.7234 27.0001 12.0051 27.0001 13.4874Z" fill="#090909" stroke="#090909" strokeWidth={2} strokeMiterlimit={10} strokeLinejoin="round" />
              </svg>
            </div>
            <TutorialButton onClick={() => {
              setOpenTutorial(false);
              setCurrentStep(0);
              setIsOpen(true)
            }}>
              <span>นักการเมืองแต่ละคน<br /> เกี่ยวข้องกับธุรกิจอะไรบ้าง?</span>
            </TutorialButton>
            <TutorialButton onClick={() => {
              setOpenTutorial(false);
              setCurrentStep(2);
              setIsOpen(true)
            }}>
              <span>ที่เกี่ยวกับนักการเมืองแบบไหน<br />รับเงินจากโครงการรัฐเยอะ?</span>
            </TutorialButton>
            <TutorialButton onClick={() => {
              setOpenTutorial(false);
              setCurrentStep(4);
              setIsOpen(true)
            }}>
              <span>บริษัทที่รับโครงการรัฐ<br />มีใครถือหุ้นบ้าง?</span>
            </TutorialButton>
          </div>
          <button className='flex flex-row items-center gap-x-[9px] py-[10.5px] px-[20px]
            w-fit mx-auto bg-white
            rounded-[40px] border-black border-[3px]'
            onClick={() => {
              let ele = document.getElementById('display-area')
              ele?.scrollTo({ top: 0 })
            }}
          >
            กลับไปด้านบน
            <svg width={18} height={20} viewBox="0 0 18 20" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M8.99477 19C8.99477 18.1288 9.53505 14.867 9.45186 14C9.31774 12.6021 8.82178 11.9134 8.80946 10.5C8.78908 8.16088 8.75586 7.59703 8.87741 5.27256C8.90547 4.73592 8.93918 4.50754 8.93918 4C8.40451 4.5132 7.74585 4.36917 7.21583 4.88947C5.23111 6.83779 -0.544392 12.8727 1.39104 10.8721C2.83864 9.37574 4.19694 7.7418 5.58514 6.1856C6.75868 4.87002 7.89038 3.41503 8.80946 1.89497C9.02275 1.54222 9.16673 0.657367 9.45186 1.14156C10.253 2.50195 11.0273 3.83533 11.9597 5.10656C13.0568 6.60229 14.1073 8.14607 15.1716 9.66534C15.2557 9.78533 15.3779 9.96045 15.5052 10.0357C16.0965 10.3849 16.4117 11.2257 17 11.5297" stroke="#090909" strokeWidth={2} strokeLinecap="round" />
            </svg>
          </button>
        </div>
      </div>
    </div>
  )
}

export default Tutorial