<template>
  <div>
    <election-header />
    <HomePageBack/>

    <div class="section-about">
      <h1>เกี่ยวกับโครงการ</h1>

      <h2>เป้าหมาย</h2>
      <p>
        มาตรา ๒๒๒ คณะกรรมการการเลือกตั้ง ประกอบด้วย
        กรรมการจำนวนเจ็ดคนซึ่งพระมหากษัตริย์ทรงแต่งตั้งตามคำแนะนำของวุฒิสภาจากบุคคล
        ดังต่อไปนี้ (๑) ผู้มีความรู้ความเชี่ยวชาญในสาขาวิชาการต่าง ๆ
        ที่จะยังประโยชน์แก่การบริหารและจัดการการเลือกตั้งให้เป็นไปโดยสุจริตและเที่ยงธรรม
        และมีความซื่อสัตย์สุจริตเป็นที่ประจักษ์
        ซึ่งได้รับการสรรหาจากคณะกรรมการสรรหา จำนวนห้าคน (๒) ผู้มีความรู้
        ความเชี่ยวชาญ และประสบการณ์ด้านกฎหมาย
        มีความซื่อสัตย์สุจริตเป็นที่ประจักษ์และเคยดำรงตำแหน่งไม่ต่ำกว่าอธิบดีผู้พิพากษา
        หรือตำแหน่งไม่ต่ำกว่าอธิบดีอัยการมาแล้วเป็นเวลาไม่น้อยกว่าห้าปี
        ซึ่งได้รับการคัดเลือกจากที่ประชุมใหญ่ศาลฎีกา จำนวนสองคน
        ผู้ซึ่งจะได้รับการสรรหาเป็นกรรมการการเลือกตั้งตาม (๑)
        ต้องมีคุณสมบัติตามมาตรา ๒๓๒ (๒) (๓) (๔) (๕) (๖) หรือ (๗)
        หรือเป็นผู้ทำงานหรือเคยทำงานในภาคประชาสังคมมาแล้วเป็นเวลาไม่น้อยกว่ายี่สิบปี
        ทั้งนี้ ตามที่คณะกรรมการสรรหาประกาศกำหนด
      </p>

      <h2>ที่มาของข้อมูล</h2>
      <p>
        มาตรา ๕๙
        รัฐต้องเปิดเผยข้อมูลหรือข่าวสารสาธารณะในครอบครองของหน่วยงานของรัฐที่มิใช่ข้อมูลเกี่ยวกับความมั่นคงของรัฐหรือเป็นความลับของทางราชการตามที่กฎหมายบัญญัติ
        และต้องจัดให้ประชาชนเข้าถึงข้อมูลหรือข่าวสารดังกล่าวได้โดยสะดวก
      </p>

      <h2>นโยบายการนำข้อมูลไปใช้ต่อ</h2>
      <p>
        ทางทีมมีความตั้งใจที่พัฒนาทุกโปรเจ็กต์ให้เป็น Open Source
        และเปิดข้อมูลเป็น Open Data ภายใต้เงื่อนไข Creative Commons
        Attribution-NonCommercial License (CC-BY-NC)
        คือสามารถนำไปเผยแพร่และดัดแปลงได้ โดยต้องระบุที่มา
        แต่ห้ามนำไปใช้เพื่อการค้า สามารถดูรายละเอียดเพิ่มเติมได้ที่
        <a
          href="wevis.info/terms-of-use"
          target="_blank"
          rel="noopener noreferrer"
          >wevis.info/terms-of-use</a
        >
        <br /><br />
        หากมีข้อสงสัยต้องการสอบถามเพิ่มเติม
        ประสงค์แจ้งเปลี่ยนแปลงหรือเพิ่มเติมข้อมูลเพื่อความถูกต้อง
        หรือมีข้อเสนอแนะใดๆ สามารถติดต่อได้ที่ team [at] punchup.world
      </p>

      <h2>ทีมงานร่วมพัฒนา</h2>
      <h3>เขียนโปรแกรม</h3>
      <p>
        <ul>
          <li>น้องฟีน</li>
          <li>น้องจิ๊ก</li>
        </ul>
      </p>
      <h3>หัวข้อ</h3>
      <p>
        <ul>
          <li>ลิสต์ 1</li>
          <li>ลิสต์ 2</li>
          <li>ลิสต์ 3</li>
        </ul>
      </p>
      <h3>หัวข้อ</h3>
      <p>
        <ul>
          <li>ลิสต์ 1</li>
          <li>ลิสต์ 2</li>
          <li>ลิสต์ 3</li>
        </ul>
      </p>
      <h3>หัวข้อ</h3>
      <p>
        <ul>
          <li>ลิสต์ 1</li>
          <li>ลิสต์ 2</li>
          <li>ลิสต์ 3</li>
        </ul>
      </p>

      <h2>หมายเหตุ</h2>
      <p>
        <a
          href="https://punchup.world/"
          target="_blank"
          rel="noopener noreferrer"
          >Punch Up</a
        >
        และ
        <a href="https://wevis.info/" target="_blank" rel="noopener noreferrer"
          >WeVis</a
        >
        ได้รับการสนับสนุนทุนในการดำเนินงานจาก
        <a href="https://www.ned.org/" target="_blank" rel="noopener noreferrer"
          >National Endowment for Democracy (NED)</a
        >
        ซึ่งนำมาใช้เป็นต้นทุนในการรวมรวมข้อมูล ออกแบบ พัฒนาเว็บไซต์ ประสานงาน
        บริหารจัดการ ตลอดจนการจัด Meetup เพื่อดำเนินโครงการ
      </p>
    </div>

    <election-bottom index-path="/theyworkforyou" />
    <election-footer />
  </div>
</template>

<script>
import {
  ElectionHeader,
  ElectionBottom,
  ElectionFooter,
} from '@thailand-election-2023/components'
export default {
  data() {
    return {}
  },
  components: {
    ElectionHeader,
    ElectionBottom,
    ElectionFooter,
  },
}
</script>